In [1]:
import pandas as pd
import statsmodels.api as sm
from statsmodels.stats.outliers_influence import variance_inflation_factor
#from google.colab import files
from datetime import date
import matplotlib.pyplot as plt
import seaborn as sns; sns.set()
from datetime import timedelta
%matplotlib inline

In [2]:
#getting nre data from yonsei
data_yonsei = pd.read_excel("DHC Insta1426_20200823.xlsx")
data_yonsei.columns = data_yonsei.iloc[0]
data_yonsei = data_yonsei.iloc[1:]

In [3]:
data_y = data_yonsei.loc[:,["shortcode","taken_at_timestamp"]+list(data_yonsei.columns[26:])]

In [4]:
data_y.columns[1:]

Index(['taken_at_timestamp',                300.0,               9199.0,
                     3690.0,              22150.0,              22151.0,
                    22152.0,              22278.0,               2451.0,
                     2158.0,
       ...
                    22389.0,              22393.0,              22661.0,
                    22430.0,                 98.0,               3615.0,
                    22372.0,              22411.0,              22412.0,
                     2141.0],
      dtype='object', name=0, length=116)

In [5]:
data_a= pd.melt(data_y,id_vars=["taken_at_timestamp"], value_vars=data_y.columns[2:12], value_name="value").dropna()

In [6]:
data_a

      taken_at_timestamp     0  value
1             1456883729   300    1.0
8             1457393609   300    1.0
112           1466391473   300    1.0
120           1468373441   300    1.0
138           1472433317   300    1.0
...                  ...   ...    ...
14138         1510721967  2449    1.0
14139         1510721970  2449    1.0
14210         1511514620  2449    1.0
14211         1511514629  2449    1.0
14212         1511514635  2449    1.0

[683 rows x 3 columns]

In [7]:
data_b = data_a.groupby(["taken_at_timestamp",0]).sum().reset_index()

In [8]:
data_b["yymmdd"]= data_b["taken_at_timestamp"].apply(date.fromtimestamp)
#dt_pm1b = dt_pm1.groupby(["product_type","yymmdd"]).sum()

In [9]:
data_b = data_b.rename(columns={"value":"product_mention",0:"product_type"}).drop(columns="taken_at_timestamp")

In [10]:
def new_pdcode(cd):
    if cd in [300,9199,9189]:
        return 309
    elif cd in [22150,22151,22152]:
        return 5152
    elif cd in [22164, 22165]:
        return 6465
    elif cd in ["22278_20170712", 22278]:
        return 222789
    else:
        return cd

In [11]:
data_b["product_type"] = data_b["product_type"].apply(lambda x:new_pdcode(int(x)))

In [12]:
data_b["product_type"].unique()

array([   309,   2451,   2158,   2449, 222789,   3690,   5152],
      dtype=int64)

In [13]:
data_b.head()

   product_type  product_mention      yymmdd
0           309              1.0  2016-03-02
1           309              1.0  2016-03-02
2          2451              1.0  2016-03-07
3           309              1.0  2016-03-08
4           309              1.0  2016-03-08

In [14]:
data_b.to_excel("data_product_mention20200918.xlsx", index=False)

In [15]:
#product list in pm data
['309', '5152', 2451, '2158', '2449', 22278, '3690']

['309', '5152', 2451, '2158', '2449', 22278, '3690']

In [112]:
#product list in sales data
prod3channel = [22152,
2158,
300,
2451,
2449,
22278,
9199,
3690,
22150]